In [1]:
import pandas as pd
import numpy as np

In [81]:
df = pd.DataFrame({"col1" :[1,2,3,4],"col2":[444,555,666,444],"col3" :["abc","def","ghi","xyz"] })

In [46]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz


반복되는 row를 제하고 unique한 row 값만 출력하도록 한다.

In [10]:
df["col2"].unique()

array([444, 555, 666], dtype=int64)

Number of unique : 유니크한 row 의 갯수를 출력

In [11]:
df["col2"].nunique()

3

In [47]:
len(df['col2'].unique())

3

** value_counts() 라는 메소드는, 유니크한 value의 반복되는 숫자를 출력해줍니다.

In [51]:
df["col2"].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64


문제 3: 아래와 같은 내용이 나오도록 코딩하시고, 학생들이 가장 좋아하는 간식 순서와 가장 좋아하는 색깔 순서가 나오도록 코딩하세요.

In [58]:
df1 = pd.DataFrame({"학생번호":[1,2,3,4,5,6,7,8],"좋아하는 간식":["햄버거","피자","김밥","햄버거","샐러드","떡볶이","샐러드","샐러드"],"좋아하는 색깔":["red","blue","blue","yellow","blue","violet","yellow","red"]})

In [65]:
df1

   학생번호 좋아하는 간식 좋아하는 색깔
0     1     햄버거     red
1     2      피자    blue
2     3      김밥    blue
3     4     햄버거  yellow
4     5     샐러드    blue
5     6     떡볶이  violet
6     7     샐러드  yellow
7     8     샐러드     red

In [63]:
df1["좋아하는 간식"].value_counts()

샐러드    3
햄버거    2
피자     1
김밥     1
떡볶이    1
Name: 좋아하는 간식, dtype: int64

In [64]:
df1["좋아하는 색깔"].value_counts()

blue      3
red       2
yellow    2
violet    1
Name: 좋아하는 색깔, dtype: int64

In [82]:
newdf = df

In [83]:
newdf

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [84]:
newdf[(newdf["col1"] > 2)&(newdf["col2"] == 444)]

   col1  col2 col3
3     4   444  xyz

두가지 조건을 한꺼번에 만족시켜야 하기 때문에 &로 조건을 줘야 한다.

In [79]:
newdf.iloc()

AttributeError: 'list' object has no attribute 'iloc'

In [92]:
def function(num):
    return num*2

In [94]:
function(df["col1"])

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [95]:
def time2(x):
    return x*2

In [96]:
df["col1"].apply(time2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [103]:
def time3(x):
    return len(x)

df["col3"].apply(time3)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [107]:
df["col3"].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [110]:
df.drop("col1",axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [112]:
del df["col1"]

In [113]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

DataFranm의 컬럼과 인덱스를 추출해서 보는 방법

In [114]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [115]:
df.index

RangeIndex(start=0, stop=4, step=1)

** sorting : 데이터 정렬

아래는 col2를 기준으로 작은 값부터 정렬을 해서 보여주는 내용이다.

In [116]:
df.sort_values(by="col2")

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

In [122]:
df==False

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [134]:
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [139]:
df.dropna()

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [180]:
df3 = pd.DataFrame({'col1':[1.0,2.0,3.0,np.nan],"col2":[np.nan,555.0,666.0,444.0],
                    "col3":["abc","def","ghi","xyz"]})

In [144]:
df3

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [145]:
df3.fillna(value="없음")

  col1   col2 col3
0  1.0     없음  abc
1  2.0  555.0  def
2  3.0  666.0  ghi
3   없음  444.0  xyz

In [176]:
df3.fillna(df3["col1"].mean())

   col1   col2 col3
0   1.0    2.0  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   2.0  444.0  xyz

In [177]:
df3.fillna(df3["col2"].mean())

    col1   col2 col3
0    1.0  555.0  abc
1    2.0  555.0  def
2    3.0  666.0  ghi
3  555.0  444.0  xyz

In [194]:
df3.fillna(df3[["col1","col2"]].mean())

   col1   col2 col3
0   1.0  555.0  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   2.0  444.0  xyz

In [198]:
df4 = pd.DataFrame({"A":['인문','인문','인문',"정보","정보","정보"],
                   "B":["1학년","1학년","2학년","2학년","1학년","1학년"],
                   "C":["여","남","여","남","여","남"],
                   "D":[90,80,75,50,100,40]})

In [199]:
df4

    A    B  C    D
0  인문  1학년  여   90
1  인문  1학년  남   80
2  인문  2학년  여   75
3  정보  2학년  남   50
4  정보  1학년  여  100
5  정보  1학년  남   40

In [205]:
df4.pivot_table(values="D",index=["A","B"],columns=["C"])

C          남      여
A  B
인문 1학년  80.0   90.0
   2학년   NaN   75.0
정보 1학년  40.0  100.0
   2학년  50.0    NaN